In [ ]:
import pandas as pd
import numpy as np

In [ ]:
drinks = pd.read_csv(r"http://bit.ly/drinksbycountry")

In [ ]:
# Setando pra mostrar quantas rows e colunas você deseja
pd.options.display.max_rows = 999
pd.options.display.max_columns = None
# Setando pra mostrar quantos caracteres vai mostrar
pd.options.display.max_colwidth = 1000
# Setando a quantidade de numeros depois da virgula
pd.options.display.precision = 2
# Pesquisando options
pd.describe_option("rows")
# Resetando todas as options
pd.reset_option('all')

In [ ]:
# Criando um Dataframe usando um Dict
df = pd.DataFrame({'id':[100,101,102],'color':['red','blue','red']},columns=['id','color'],index=['a','b','c'])
# Entende cada array como uma row
pd.DataFrame([[100,'red'],[101,'blue'],[102,'red']],columns=['id','color'])
# Gerando informações com o numpy
pd.DataFrame({'student':np.arange(100,110,1),'grade':np.random.randint(30,101,10)}).set_index('student')
# Criando uma series e concatenando com o df
series = pd.Series(['round','square'],index=['c','b'],name='shape')
pd.concat([df,series],axis=1)

In [41]:
train = pd.read_csv(r"http://bit.ly/kaggletrain")
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

      Sex  Sex_num
0    male        1
1  female        0
2  female        0
3  female        0
4    male        1

In [55]:
# Usando map pra transformar Fem = 0 e Male = 1
train['Sex_num'] = train.Sex.map({'female':0,'male':1})
train.loc[0:4,['Sex','Sex_num']]

# Usando Apply pra criar outra coluna de Len
train['Name_length'] = train.Name.apply(len)
train.loc[0:4,['Name','Name_length']]

# Usando Apply pra pegar o primeiro nome com lambda
# Podemos passar o axis no apply também
train['First_name'] = train.Name.apply(lambda x: (x.split(","))[0].strip())
train.loc[0:4,['Name','First_name']]

# ou pode fazer desse jeito também
def get_element(list,position):
    return list[position]
train['First_name2'] = train.Name.str.split(',').apply(get_element,position=0)
train.loc[0:4,['Name','First_name','First_name2']]

# O applymap aplica uma função em cada elemento do dataframe
# Aqui eu multiplico todos os numeros por 10 no dataframe
drinks.applymap(lambda x: x*10 if type(x) in [int,float] else x)

C:\Users\Windows\AppData\Local\Temp\ipykernel_10760\507290318.py:18: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  drinks.applymap(lambda x: x*10 if type(x) in [int,float] else x)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,890,1320,540,49.0,Europe
2,Algeria,250,0,140,7.0,Africa
3,Andorra,2450,1380,3120,124.0,Europe
4,Angola,2170,570,450,59.0,Africa
...,...,...,...,...,...,...
188,Venezuela,3330,1000,30,77.0,South America
189,Vietnam,1110,20,10,20.0,Asia
190,Yemen,60,0,0,1.0,Asia
191,Zambia,320,190,40,25.0,Africa
192,Zimbabwe,640,180,40,47.0,Africa